# Partie II. Router-on-a-stick

Alors quoi, on ajoute un routeur + un switch dÃ¨s qu'on rajoute un rÃ©seau ? Woah hÃ© le bordel hÃ©.

Et dans la vraie vie, c'est physique tout Ã§a, ils sont oÃ¹ ces Ã©quipements ? Un routeur + un switch par salle ? Rich boi.

Et s'il y a des gens de rÃ©seaux diffÃ©rents dans la mÃªme salle, on fait comment ? (genre un serveur et Jean-Mi qui bosse Ã  la compta dans la mÃªme piÃ¨ce).

**Une topologie un peu plus classique pour ce genre de rÃ©seau c'est le *router-on-a-stick*** (tellement classique qu'on lui a donnÃ© un nom oÃ¨).

## 1. SchÃ©ma

## 2. Tableau d'adressage

### A. RÃ©seaux

| RÃ©seau | Adresse RÃ©seau | VLAN |
| ------ | -------------- | ---- |
| `LAN1` | `10.3.1.0/24`  | 10   |
| `LAN2` | `10.3.2.0/24`  | 20   |
| `LAN3` | `10.3.3.0/24`  | 30   |

### B. Tableau adressage

| Machine       | `LAN1`       | `LAN2`       | `LAN3`       |
| ------------- | ------------ | ------------ | ------------ |
| `pc1.tp3.b2`  | `10.3.1.1`   | x            | x            |
| `pc2.tp3.b2`  | x            | `10.3.2.1`   | x            |
| `pc3.tp3.b2`  | `10.3.1.2`   | x            | x            |
| `pc4.tp3.b2`  | x            | DHCP         | x            |
| `dhcp.tp3.b2` | x            | `10.3.2.253` | x            |
| `r1.tp3.b2`   | `10.3.1.254` | `10.3.2.254` | `10.3.3.254` |
| `dns.tp3.b2`  | x            | x            | `10.3.3.1`   |
| `web.tp3.b2`  | x            | x            | `10.3.3.2`   |

## 3. Marche Ã  suivre

### A. VLANs

âžœ **On configure les switches en premier**

- cette fois, les switches vont avoir Ãªtre responsable d'une partie de la logique
- on va y configurer des VLANs
- munissez-vous du [mÃ©mo Cisco](../../memo/cisco.md#a-vlan), y'a tout dedans !

âžœ **DÃ©clarer les VLANs**

- sur tous les switches, vous dÃ©clarez tous les VLANs

âžœ **DÃ©finir les ports `access`**

- ce sont les ports avec des clients du rÃ©seau branchÃ©s
- donc les VPCS, les serveurs (VMs)
- cela permet de dÃ©finir dans quel VLAN se trouve tel ou tel client du rÃ©seau

âžœ **DÃ©finir les ports `trunk`**

- ce sont les ports avec d'autres Ã©quipements rÃ©seau connectÃ©s
- un port sur lequel y'a un autre switch connectÃ©
- aussi un port sur lequel un routeur est connectÃ©

ðŸŒž **Tests de `ping`**

- une fois tous les VLANs en place, les membres d'un mÃªme VLAN sont autorisÃ©s Ã  se `ping`
- prouvez que `client1` et `client3` peuvent se `ping`

--------------------------------------------------------------------------

`PC 1 vers PC 3`
````
PC1> ping 10.3.1.2

84 bytes from 10.3.1.2 icmp_seq=1 ttl=64 time=0.682 ms
84 bytes from 10.3.1.2 icmp_seq=2 ttl=64 time=1.176 ms
84 bytes from 10.3.1.2 icmp_seq=3 ttl=64 time=0.815 ms
84 bytes from 10.3.1.2 icmp_seq=4 ttl=64 time=1.162 ms
84 bytes from 10.3.1.2 icmp_seq=5 ttl=64 time=0.973 ms

````
`PC 2 vers PC 4`

````
PC2> ping 10.3.2.2

84 bytes from 10.3.2.2 icmp_seq=1 ttl=64 time=0.559 ms
84 bytes from 10.3.2.2 icmp_seq=2 ttl=64 time=0.798 ms
84 bytes from 10.3.2.2 icmp_seq=3 ttl=64 time=1.080 ms
84 bytes from 10.3.2.2 icmp_seq=4 ttl=64 time=0.884 ms
84 bytes from 10.3.2.2 icmp_seq=5 ttl=64 time=1.024 ms

````

### B. Routeur

âžœ **On passe sur le routeur**

- on a un soucis : le routeur a une seule interface qui doit servir de passerelle pour tous les LANs
- il doit donc avoir plusieurs adresses IP sur une seule interface !
- on fait Ã§a avec des sous-interfaces :
  - on "dÃ©coupe" l'interface en plusieurs sous-interfaces
  - chacune des sous-interfaces a une adresse IP
  - chaque sous-interface est dÃ©finie comme Ã©tant dans un VLAN particulier

âžœ **Configuration IP du routeur**

- adresse IP DHCP cÃ´tÃ© nuage
- adresses IP sur les sous-interfaces qui pointent vers le LAN
- n'oubliez pas d'allumer les interfaces

ðŸŒž **Tests de `ping`**

- le routeur peut ping tout le monde
- le `LAN1` et le `LAN2` se `ping`
  - prouvez le avec un `show ip` suivi d'un `ping` sur un VPCS

````
PC2> sh ip

NAME        : PC2[1]
IP/MASK     : 10.3.2.1/24
GATEWAY     : 10.3.2.254
DNS         :
MAC         : 00:50:79:66:68:01
LPORT       : 20020
RHOST:PORT  : 127.0.0.1:20021
MTU         : 1500

PC2> ping 10.3.1.1

84 bytes from 10.3.1.1 icmp_seq=1 ttl=63 time=20.011 ms
84 bytes from 10.3.1.1 icmp_seq=2 ttl=63 time=13.141 ms
84 bytes from 10.3.1.1 icmp_seq=3 ttl=63 time=27.810 ms
84 bytes from 10.3.1.1 icmp_seq=4 ttl=63 time=12.692 ms
84 bytes from 10.3.1.1 icmp_seq=5 ttl=63 time=15.577 ms


````

âžœ **Configuration du NAT**

- configurez du NAT sur le routeur pour que les clients aient un accÃ¨s Internet

ðŸŒž **Tests de `ping`**

- le routeur peut ping internet
- n'importe quel client a un accÃ¨s internet

````
R1#ping 1.1.1.1

Type escape sequence to abort.
Sending 5, 100-byte ICMP Echos to 1.1.1.1, timeout is 2 seconds:
.!!!!
Success rate is 80 percent (4/5), round-trip min/avg/max = 68/87/96 ms
````
````
PC1> ping 1.1.1.1

84 bytes from 1.1.1.1 icmp_seq=1 ttl=58 time=35.015 ms
84 bytes from 1.1.1.1 icmp_seq=2 ttl=58 time=36.085 ms
84 bytes from 1.1.1.1 icmp_seq=3 ttl=58 time=41.733 ms
84 bytes from 1.1.1.1 icmp_seq=4 ttl=58 time=53.997 ms
84 bytes from 1.1.1.1 icmp_seq=5 ttl=58 time=31.964 ms
````


## La suiiite

Direction la [**Partie 3 : Services**](./services.md), toujours avec cette topologie.